Tekla Open API Reference for Tekla Structures 2025
Angle.Degrees Property
 Gets the angle value in degrees
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Degrees { get; }
Public ReadOnly Property Degrees As Double
	Get
Property Value
Type: Double
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace